## Pandas
pandas is an open source Python library for data analysis. Python has always been great for prepping and munging data, but it's never been great for analysis - you'd usually end up using R or loading it into a database and using SQL (or worse, Excel). pandas makes Python great for analysis.

## Data Structures
pandas introduces two new data structures to Python - Series and DataFrame, both of which are built on top of NumPy (this means it's fast).

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
pd.set_option('max_columns', 50)
%matplotlib inline

## Series
A Series is a one-dimensional object similar to an array, list, or column in a table. It will assign a labeled index to each item in the Series. By default, each item will receive an index label from 0 to N, where N is the length of the Series minus one.

In [2]:
# create a Series with an arbitrary list
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'])
s

0                7
1       Heisenberg
2             3.14
3      -1789710578
4    Happy Eating!
dtype: object

Alternatively, you can specify an index to use when creating the Series.

In [3]:
s = pd.Series([7, 'Heisenberg', 3.14, -1789710578, 'Happy Eating!'],
              index=['A', 'Z', 'C', 'Y', 'E'])
s

A                7
Z       Heisenberg
C             3.14
Y      -1789710578
E    Happy Eating!
dtype: object

The Series constructor can convert a dictonary as well, using the keys of the dictionary as its index.

In [4]:
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
cities = pd.Series(d)
cities

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
Boston              NaN
dtype: float64

You can use the index to select specific items from the Series ...

In [5]:
# Get just Chicago
cities['Chicago']

1000.0

In [6]:
# Get Chicago, Portland & San Francisco
cities[['Chicago', 'Portland', 'San Francisco']]

Chicago          1000.0
Portland          900.0
San Francisco    1100.0
dtype: float64

Or you can use boolean indexing for selection.

In [7]:
# Just get cities with less than 1000
cities[cities < 1000]

Portland    900.0
Austin      450.0
dtype: float64

That last one might be a little weird, so let's make it more clear - cities < 1000 returns a Series of True/False values, which we then pass to our Series cities, returning the corresponding True items.

In [8]:
less_than_1000 = cities < 1000
print(less_than_1000)
print('\n')
print(cities[less_than_1000])

Chicago          False
New York         False
Portland          True
San Francisco    False
Austin            True
Boston           False
dtype: bool


Portland    900.0
Austin      450.0
dtype: float64

You can also change the values in a Series on the fly.

In [9]:
# changing based on the index
print('Old value:', cities['Chicago'])
cities['Chicago'] = 1400
print('New value:', cities['Chicago'])

Old value: 1000.0
New value: 1400.0

In [10]:
# changing values using boolean logic
print(cities[cities < 1000])
print('\n')
cities[cities < 1000] = 750

print(cities[cities < 1000])

Portland    900.0
Austin      450.0
dtype: float64


Portland    750.0
Austin      750.0
dtype: float64

What if you aren't sure whether an item is in the Series? You can check using idiomatic Python.

In [11]:
# Check if Seattle in the city list
print('Seattle' in cities)
# Check if San Francisco in the city list
print('San Francisco' in cities)

False
True

Mathematical operations can be done using scalars and functions.

In [12]:
# divide city values by 3
cities / 3

Chicago          466.666667
New York         433.333333
Portland         250.000000
San Francisco    366.666667
Austin           250.000000
Boston                  NaN
dtype: float64

In [13]:
# square city values
np.square(cities)

Chicago          1960000.0
New York         1690000.0
Portland          562500.0
San Francisco    1210000.0
Austin            562500.0
Boston                 NaN
dtype: float64

NULL checking can be performed with isnull and notnull.

In [14]:
# use boolean logic to grab the NULL cities
print(cities.isnull())
print('\n')
print(cities[cities.isnull()])

Chicago          False
New York         False
Portland         False
San Francisco    False
Austin           False
Boston            True
dtype: bool


Boston   NaN
dtype: float64

## DataFrame
A DataFrame is a tablular data structure comprised of rows and columns, akin to a spreadsheet, database table, or R's data.frame object. You can also think of a DataFrame as a group of Series objects that share an index (the column names).

## Reading Data
To create a DataFrame out of common Python data structures, we can pass a dictionary of lists to the DataFrame constructor.

Using the columns parameter allows us to tell the constructor how we'd like the columns ordered. By default, the DataFrame constructor will order the columns alphabetically (though this isn't the case when reading from a file - more on that next).

In [15]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

## CSV

Reading a CSV is as simple as calling the read_csv function. By default, the read_csv function expects the column separator to be a comma, but you can change that using the sep parameter.

In [16]:
from_csv = pd.read_csv('mariano-rivera.csv')
from_csv.head()

,Year,Age,Tm,Lg,W,L,W-L%,ERA,G,GS,GF,CG,SHO,SV,IP,H,R,ER,HR,BB,IBB,SO,HBP,BK,WP,BF,ERA+,WHIP,H/9,HR/9,BB/9,SO/9,SO/BB,Awards
0,1995,25,NYY,AL,5,3,0.625,5.51,19,10,2,0,0,0,67.0,71,43,41,11,30,0,51,2,1,0,301,84,1.507,9.5,1.5,4.0,6.9,1.70,NaN
1,1996,26,NYY,AL,8,3,0.727,2.09,61,0,14,0,0,5,107.2,73,25,25,1,34,3,130,2,0,1,425,240,0.994,6.1,0.1,2.8,10.9,3.82,CYA-3MVP-12
2,1997,27,NYY,AL,6,4,0.600,1.88,66,0,56,0,0,43,71.2,65,17,15,5,20,6,68,0,0,2,301,239,1.186,8.2,0.6,2.5,8.5,3.40,ASMVP-25
3,1998,28,NYY,AL,3,0,1.000,1.91,54,0,49,0,0,36,61.1,48,13,13,3,17,1,36,1,0,0,246,233,1.060,7.0,0.4,2.5,5.3,2.12,NaN

Our file had headers, which the function inferred upon reading in the file. Had we wanted to be more explicit, we could have passed header=None to the function along with a list of column names to use:

## Working with DataFrames
Now that we can get data into a DataFrame, we can finally start working with them. pandas has an abundance of functionality, far too much for me to cover in this introduction. I'd encourage anyone interested in diving deeper into the library to check out its excellent documentation. Or just use Google - there are a lot of Stack Overflow questions and blog posts covering specifics of the library.

We'll be using the MovieLens dataset in many examples going forward. The dataset contains 100,000 ratings made by 600 users on 9,000 movies.

In [17]:
# pass in column names for each CSV
u_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_csv('users.csv', names=u_cols,)

r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('ratings.csv', names=r_cols)

# the movies file contains columns indicating the movie's genres
# let's only load the first five columns of the file with usecols
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
movies = pd.read_csv('movies.csv', names=m_cols, usecols=range(5))
movies['movie_id'] = pd.to_numeric(movies['movie_id'], errors='coerce').fillna(1)
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

## Inspection
pandas has a variety of functions for getting basic information about your DataFrame, the most basic of which is using the info method.

In [18]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   movie_id            1682 non-null   int64
 1   title               1682 non-null   object
 2   release_date        1681 non-null   object
 3   video_release_date  0 non-null      float64
 4   imdb_url            1679 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 65.8+ KB

The output tells a few things about our DataFrame.

It's obviously an instance of a DataFrame.
Each row was assigned an index of 0 to N-1, where N is the number of rows in the DataFrame. pandas will do this by default if an index is not specified. Don't worry, this can be changed later.
There are 1,682 rows (every row must have an index).
Our dataset has five total columns, one of which isn't populated at all (video_release_date) and two that are missing some values (release_date and imdb_url).
The last datatypes of each column, but not necessarily in the corresponding order to the listed columns. You should use the dtypes method to get the datatype for each column.
An approximate amount of RAM used to hold the DataFrame. See the .memory_usage method

In [19]:
movies.dtypes

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

DataFrame's also have a describe method, which is great for seeing basic statistics about the dataset's numeric columns. Be careful though, since this will return information on all columns of a numeric datatype.

In [20]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

We can quickly see the average age of our users is just above 34 years old, with the youngest being 7 and the oldest being 73. The median age is 31, with the youngest quartile of users being 25 or younger, and the oldest quartile being at least 43.

You've probably noticed that I've used the head method regularly throughout this post - by default, head displays the first five records of the dataset, while tail displays the last five.

In [21]:
movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

Use the .unique() function to get all the unique entries in a column

In [22]:
users.occupation

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

In [23]:
users.occupation.unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

## Selecting
You can think of a DataFrame as a group of Series that share an index (in this case the column headers). This makes it easy to select specific columns.

Selecting a single column from the DataFrame will return a Series object.

In [24]:
users['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

To select multiple columns, simply pass a list of column names to the DataFrame, the output of which will be a DataFrame.

In [25]:
print(users[['age', 'zip_code']].head())
print('\n')

# can also store in a variable to use later
columns_you_want = ['occupation', 'gender'] 
print(users[columns_you_want].head())

   age zip_code
0   24    85711
1   53    94043
2   23    32067
3   24    43537
4   33    15213


   occupation gender
0  technician      M
1       other      F
2      writer      M
3  technician      M
4       other      F

Row selection can be done multiple ways, but doing so by an individual index or boolean indexing are typically easiest.

In [26]:
# users older than 25
print(users[users.age > 25].head(3))
print('\n')

# users aged 40 AND male
print(users[(users.age == 40) & (users.gender == 'M')].head(3))
print('\n')

# users younger than 30 OR female
print(users[(users.gender == 'F') | (users.age < 30)].head(3))

   user_id  age gender occupation zip_code
1        2   53      F      other    94043
4        5   33      F      other    15213
5        6   42      M  executive    98101


     user_id  age gender  occupation zip_code
18        19   40      M   librarian     2138
82        83   40      M       other    44133
115      116   40      M  healthcare    97232


   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067

## Joining
Throughout an analysis, we'll often need to merge/join datasets as data is typically stored in a relational manner.

Our MovieLens data is a good example of this - a rating requires both a user and a movie, and the datasets are linked together by a key - in this case, the user_id and movie_id. It's possible for a user to be associated with zero or many ratings and movies. Likewise, a movie can be rated zero or many times, by a number of different users.

Like SQL's JOIN clause, pandas.merge allows two DataFrames to be joined on one or more keys. The function provides a series of parameters (on, left_on, right_on, left_index, right_index) allowing you to specify the columns or indexes on which to join.

By default, pandas.merge operates as an inner join, which can be changed using the how parameter.

In [27]:
movies.head(3)

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...

In [28]:
ratings.head(3)

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116

In [29]:
users.head(3)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067

In [30]:
movie_ratings.head(3)

NameError: name 'movie_ratings' is not defined

In [31]:
# create one merged DataFrame
movie_ratings = pd.merge(movies, ratings)
lens = pd.merge(movie_ratings, users)
lens.head()

,movie_id,title,release_date,video_release_date,imdb_url,user_id,rating,unix_timestamp,age,gender,occupation,zip_code
0,1,Toy Story (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,308,4,887736532,60,M,retired,95076
1,4,Get Shorty (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,308,5,887737890,60,M,retired,95076
2,5,Copycat (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),308,4,887739608,60,M,retired,95076
3,7,Twelve Monkeys (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Twelve%20Monk...,308,4,887738847,60,M,retired,95076
4,8,Babe (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Babe%20(1995),308,5,887736696,60,M,retired,95076


### What are the top 10 most rated movies?

In [32]:
# return number of rows associated to each title
most_rated = lens.groupby(['title', 'movie_id']).size().sort_values(ascending=False).reset_index()[:50]
most_rated

                                           title  movie_id    0
0                               Star Wars (1977)        50  583
1                                 Contact (1997)       258  509
2                                   Fargo (1996)       100  508
3                      Return of the Jedi (1983)       181  507
4                               Liar Liar (1997)       294  485
5                    English Patient, The (1996)       286  481
6                                  Scream (1996)       288  478
7                               Toy Story (1995)         1  452
8                           Air Force One (1997)       300  431
9                  Independence Day (ID4) (1996)       121  429
10                Raiders of the Lost Ark (1981)       174  420
11                         Godfather, The (1972)       127  413
12                           Pulp Fiction (1994)        56  394
13                         Twelve Monkeys (1995)         7  392
14              Silence of the Lambs, The (1991)        98  390
15                          Jerry Maguire (1996)       237  384
16                              Rock, The (1996)       117  378
17               Empire Strikes Back, The (1980)       172  367
18               Star Trek: First Contact (1996)       222  365
19                     Back to the Future (1985)       204  350
20                                Titanic (1997)       313  350
21                    Mission: Impossible (1996)       405  344
22                          Fugitive, The (1993)        79  336
23     Indiana Jones and the Last Crusade (1989)       210  331
24  Willy Wonka and the Chocolate Factory (1971)       151  326
25                    Princess Bride, The (1987)       173  324
26                           Forrest Gump (1994)        69  321
27                             Saint, The (1997)       748  316
28        Monty Python and the Holy Grail (1974)       168  316
29                        Full Monty, The (1997)       269  315
30                           Men in Black (1997)       257  303
31                        Terminator, The (1984)       195  301
32             E.T. the Extra-Terrestrial (1982)       423  300
33                       Dead Man Walking (1995)         9  299
34                       Schindler's List (1993)       318  298
35                      Leaving Las Vegas (1995)       276  298
36                             Braveheart (1995)        22  297
37                      L.A. Confidential (1997)       302  297
38             Terminator 2: Judgment Day (1991)        96  295
39                      Conspiracy Theory (1997)       328  295
40                                Twister (1996)       118  293
41                          Birdcage, The (1996)        25  293
42                     Mr. Holland's Opus (1995)        15  293
43                                  Alien (1979)       183  291
44                When Harry Met Sally... (1989)       216  290
45                                 Aliens (1986)       176  284
46              Shawshank Redemption, The (1994)        64  283
47                          Groundhog Day (1993)       202  280
48                                   Jaws (1975)       234  280
49                                Amadeus (1984)       191  276

In [33]:
# return number of rows associated to each title
most_rated = lens.groupby(['title', 'movie_id', 'rating']).size().sort_values(ascending=False).reset_index()[:15]
most_rated

                               title  movie_id  rating    0
0                   Star Wars (1977)        50       5  325
1                       Fargo (1996)       100       5  227
2              Godfather, The (1972)       127       5  214
3                     Contact (1997)       258       4  212
4          Return of the Jedi (1983)       181       4  208
5                   Toy Story (1995)         1       4  202
6     Raiders of the Lost Ark (1981)       174       5  202
7                Pulp Fiction (1994)        56       5  188
8            Schindler's List (1993)       318       5  186
9   Silence of the Lambs, The (1991)        98       5  181
10                    Titanic (1997)       313       5  179
11                      Fargo (1996)       100       4  179
12                  Star Wars (1977)        50       4  176
13   Empire Strikes Back, The (1980)       172       5  172
14              Jerry Maguire (1996)       237       4  171

In [34]:
lens.groupby('title').size()

title
'Til There Was You (1997)                  9
1-900 (1994)                               5
101 Dalmatians (1996)                    109
12 Angry Men (1957)                      125
187 (1997)                                41
                                        ...
Young Guns II (1990)                      44
Young Poisoner's Handbook, The (1995)     41
Zeus and Roxanne (1997)                    6
unknown                                    9
 kldum klaka (Cold Fever) (1994)         1
Length: 1664, dtype: int64

## How many movies were released per year?
Let's use a line chart to investigate.

In [35]:
# create the year column from Movie title 
lens["year"] = lens["title"].str.extract("\((\d{4})\)", expand=True)

# return number of rows by the year 
year_counts = lens[["title", "year"]].groupby("year").size()
year_counts

year
1922       54
1926        2
1930       18
1931       44
1932       12
        ...
1994     9034
1995    12408
1996    18745
1997    15384
1998      851
Length: 71, dtype: int64

## How many Men/Women rated movies?

In [36]:
# count the number of male and female raters
gender_counts = lens.gender.value_counts()
gender_counts

M    74260
F    25740
Name: gender, dtype: int64

In [37]:
# lens.reset_index('movie_id', inplace=True)
pivoted = lens.pivot_table(index=['movie_id', 'title'],
                           columns=['gender'],
                           values='rating',
                           fill_value=0)
pivoted.head()

gender                             F         M
movie_id title
1        Toy Story (1995)   3.789916  3.909910
2        GoldenEye (1995)   3.368421  3.178571
3        Four Rooms (1995)  2.687500  3.108108
4        Get Shorty (1995)  3.400000  3.591463
5        Copycat (1995)     3.772727  3.140625

In [38]:
pivoted['diff'] = pivoted.M - pivoted.F
pivoted.head()

gender                             F         M      diff
movie_id title
1        Toy Story (1995)   3.789916  3.909910  0.119994
2        GoldenEye (1995)   3.368421  3.178571 -0.189850
3        Four Rooms (1995)  2.687500  3.108108  0.420608
4        Get Shorty (1995)  3.400000  3.591463  0.191463
5        Copycat (1995)     3.772727  3.140625 -0.632102

In [39]:
pivoted.reset_index('movie_id', inplace=True)

In [40]:
disagreements = pivoted[pivoted.movie_id.isin(most_rated.index)]['diff'].sort_values()
disagreements

title
Copycat (1995)                                         -0.632102
GoldenEye (1995)                                       -0.189850
Babe (1995)                                            -0.075157
Dead Man Walking (1995)                                -0.043452
Shanghai Triad (Yao a yao yao dao waipo qiao) (1995)   -0.028571
Usual Suspects, The (1995)                              0.065728
Seven (Se7en) (1995)                                    0.095268
Postino, Il (1994)                                      0.109091
Toy Story (1995)                                        0.119994
Richard III (1995)                                      0.169565
Get Shorty (1995)                                       0.191463
Mighty Aphrodite (1995)                                 0.208042
Twelve Monkeys (1995)                                   0.300315
Four Rooms (1995)                                       0.420608
Name: diff, dtype: float64